---
title: ElectricalLoadClassification
classe: Autodesk.Revit.DB.Electrical.ElectricalLoadClassification
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# ElectricalLoadClassification

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Abbreviation { get; set; }` | `electricalLoadClassification.Abbreviation` | String |
| `String ActualElectricalLoadLabel { get; set; }` | `electricalLoadClassification.ActualElectricalLoadLabel` | String |
| `ElementId DemandFactorId { get; set; }` | `electricalLoadClassification.DemandFactorId` | ElementId |
| `String LoadSummaryDemandFactorLabel { get; set; }` | `electricalLoadClassification.LoadSummaryDemandFactorLabel` | String |
| `Boolean Motor { get; }` | `electricalLoadClassification.Motor` | Boolean |
| `Boolean Other { get; }` | `electricalLoadClassification.Other` | Boolean |
| `String PanelConnectedCurrentLabel { get; set; }` | `electricalLoadClassification.PanelConnectedCurrentLabel` | String |
| `String PanelConnectedLabel { get; set; }` | `electricalLoadClassification.PanelConnectedLabel` | String |
| `String PanelEstimatedCurrentLabel { get; set; }` | `electricalLoadClassification.PanelEstimatedCurrentLabel` | String |
| `String PanelEstimatedLabel { get; set; }` | `electricalLoadClassification.PanelEstimatedLabel` | String |
| `ElectricalLoadClassificationSpace SpaceLoadClass { get; set; }` | `electricalLoadClassification.SpaceLoadClass` | ElectricalLoadClassificationSpace |
| `Boolean Spare { get; }` | `electricalLoadClassification.Spare` | Boolean |
| `ElectricalLoadClassification Create(Document, String)` | `ElectricalLoadClassification.Create(ADoc, strName)` | ElectricalLoadClassification |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```